<template>
    <div class="content">
        <img src="./assets/img/cpp.png" alt="">
        <h1>Вітаємо!</h1>
        <p>Ви знаходитеся на сайті, що надає інформацію про об'єктно-орієнтоване програмування на мові С++.
            Головна ціль цього сайту - показати загальну картину того, як у сучасному світі створюють програмне забезпечення та інструменти які використовують програмісти.
            Матеріал містить ілюстрації, блок-схеми, аудіо-відео інформацію, задачі та тести для закріплення знань.
            Тут ви ознайомитеся з класами, перевантаженням функцій, конструкторами та деструкторами, успадкуванням, віртуальними функціями та з іншими перевагами об'єктно-орієнтованого програмування.</p>
        <p>Тести, що містяться у темах посібника, можуть зберігатися для зручності на сайті, для цього вам необхідно зареєструватися на сторінці з власним <router-link :to="{ path: '/progress'}">прогресом</router-link>.
        <p>Щоб розпочати використовувати посібник, перейдіть до його <router-link :to="{ path: '/list'}">змісту</router-link>, або почніть з самого
            <router-link :to="{ path: '/post/5'}">початку</router-link>.</p>
    </div>
</template>



<style lang="scss" scoped>
.content{
    h1{
        text-align: center;
        font-size: 48px;
        color: #444;
        font-family: "PT Sans","Helvetica Neue",Helvetica,Arial,sans-serif;
    }
    p{
        color: #444;
        font-family: "PT Sans","Helvetica Neue",Helvetica,Arial,sans-serif;
    }
    img{
        width: 200px;
        margin: 0 auto;
        display: block;
    }
}
</style>
